import re

# LESSONS 3
"""
    функція
        - автоматично нормалізує номери телефонів до потрібного формату, видаляючи всі зайві символи та додаючи міжнародний код країни, якщо потрібно.
        - залишаючи тільки цифри та символ '+' на початку
        
    Параметри функції:
        - phone_number - це рядок з телефонним номером у різноманітних форматах.
        
    Результат:
        -повертає нормалізований телефонний номер у вигляді рядка.
        -Якщо номер не містить міжнародного коду, функція автоматично додає код '+38' (для України)
        -Функція видаляє всі символи, крім цифр та символу '+'
        -коли номер починається з '380' (додається лише '+') та коли номер починається без коду (додається '+38').
"""
def normalize_phone(phone_number):
    # видалаляємо все, крім цифер
    # pattern = r"[+;,\-:!\.\\t\\n()\s]"
    pattern = r"[^\d]"
    formatted_phone_number = re.sub(pattern, "", phone_number)
    
    # перевіряємо чи починається номер з коду країни
    prefix = "+" if formatted_phone_number.startswith("38") else "+38"    
    formatted_phone_number = prefix + formatted_phone_number
    
    # фінальна перевірка номерів телефону ну к-ть цифр, після коду повинно бути 10 цифр +38XXXXXXXXXX
    pattern = r"\+38\d{10}"
    if re.fullmatch(pattern, formatted_phone_number):
        return formatted_phone_number
    else:
        return None  # Якщо формат неправильний (більше або менше цифр)--> None

#---------------------------------------------------------
raw_numbers = [
    "    +38(050)123-32-34",
    "     0503451234",
    "(050)8889900",
    "38050-111-22-22",
    "38050+111+22+25+",
    "38050 111 22 11   ",
    "067\\t123 4567",
    "067\\t123 4568!",
    "067\\t123 4569(mob)",
    "067\\t123 4578(home)",
    "(095) 234-5678\\n",
    "+380 44 123 4567",
    "380501234567",
    "    +38(050)123-32-34",
    "     0503451234",
    "(050)8889900",
    "38050-111-22-22",
    "38050 111 22 11   ",
    "38050 111 22 1189   ",
    "38050 111 22 "
]

sanitized_numbers = [normalize_phone(num) for num in raw_numbers]
print("Нормалізовані номери телефонів для SMS-розсилки:", sanitized_numbers)